[
 {
   "id": 1,
   "content": "\n<h1> HTML Semântico</h1>\n<p> Uma boa parte da acessibilidade, trata-se de fazer o uso do HTML semântico na hora do desenvolvimento de front-end.  Além de ter um papel importante em auxiliar os leitores de tela, que são muito utilizados por deficientes visuais, facilitam a manutenção, compreensão do documento, colaborando inclusive no rankeamento de SEO.</p>\n<br>\n<p>Algumas das tags mais importantes são:</p>\n<ul>\n<li><strong>&lt header &gt</strong> - é utilizado para representar o cabeçalho de um documento ou seção declarado no HTML.</li>\n<li><strong>&lt nav &gt</strong> - representa uma seção de uma página que aponta para outras páginas ou para outras áreas da página, ou seja, uma seção com links de navegação.</li>\n<li><strong>&lt section &gt</strong> -representa uma seção genérica contida em um documento HTML. </li>\n<li><strong>&lt footer &gt</strong> - é utilizado para representar um rodapé, que pode conter informações sobre o autor da seção de dados, direitos autorais ou links para documentos relacionados.</li>\n</ul>\n<br>\n<p>Confira todas as tags do HTML semântico na <a href=”https://developer.mozilla.org/pt-BR/docs/Glossary/Semantics>MDN Docs</a></p>"
 },
 {
   "id": 2,
   "content": "<h1>Atributo ALT</h1>\n<p>Alt text acompanha as imagens presentes no HTML, que é lido em voz alta por leitores de tela, ajudando os usuários com deficiência visual a compreender o conteúdo disponível na página. Ele também aparece na página caso o conteúdo não tenha sido carregado corretamente. Alt text é o texto escrito exibido no lugar dessas imagens.</p>\n\n<br>\n<h2>Boas práticas para o uso do atributo ALT:</h2>\n<p>O atributo de imagem “ALT” tem de ser utilizado com bom senso e a partir da seguinte idéia: tudo que for escrito nele será ouvido a toda hora que o leitor de tela passar por ele.</p>\n<p>As imagens decorativas utilizadas para decorar a página ou partes dela, deverão ser ignoradas pelos recursos de tecnologia assistiva, ou seja, deve-se deixar o conteúdo do atributo alt vazio (alt=””), para que a imagem seja ignorada pelos leitores de tela. Outra opção é utilizar essas imagens através de CSS.</p>\n<p>O texto deve ser curto e sucinto. Não existe uma restrição oficial para o tamanho do texto alternativo fornecido no alt, mas especialistas recomendam que ele seja inferior a 125 caracteres.</p>\n<br>\n<p>Fontes: <a href=”https://www.ufrgs.br/acessibilidadedigital/atributo-alt/”>UFRGS</a> e <a href=”https://imasters.com.br/acessibilidade/dica-de-acessibilidade-atributos-alt-vazios”>iMasters</a></p>\n"
 },
 {
   "id": 3,
   "content": "<h1>vLibras</h1>\n<p>O VLibras é uma plataforma de código aberto, livre e gratuita, que traduz automaticamente conteúdos digitais em diversos suportes (textos, áudios e vídeos) para a Língua Brasileira de Sinais (Libras) através de tradução automática e uso de um Avatar 3D, tornando computadores, dispositivos móveis e websites acessíveis para pessoas surdas. </p>\n<p>Na Suíte VLibras, os sinais em Libras são reproduzidos utilizando um intérprete virtual de Libras, um avatar 3D, chamado Ícaro. O VLibras também dispõe de uma ferramenta de computação humana, denominada WikiLibras, que permite que colaboradores surdos e especialistas em Libras possam manter e evoluir o seu vocabulário de sinais e suas regras de tradução. Atualmente o VLibras conta com um vocabulário composto por mais de 14 mil sinais, um dos maiores deste tipo no mundo.</p>\n<p>Adicionalmente o VLibras também dispõe de uma API (Application Programming Interface) de programação que permite que outros programadores ou desenvolvedores de software possam incluir suporte a Libras em seus sistemas, serviços e aplicações.</p>\n\n<p>Acesse a ferramenta em:<a href=”https://www.gov.br/governodigital/pt-br/vlibras”>vLibras</a></p>\n\n<p>Fonte: <a href=”https://transforma.fbb.org.br/tecnologia-social/vlibras-uma-tecnologia-livre-e-gratuita-para-inclusao-digital-de-pessoas-surdas”>Fundação BB</a></p>\n"
 },
 {
   "id": 4,
   "content": "<h1>Leitores de Tela</h1>\n\n<h2>O que são Leitores de Tela?</h2>\n<p>Leitores de tela são softwares usados para obter resposta do computador por meio sonoro, usado principalmente por deficientes visuais. O programa vai percorrendo textos e imagens e lendo em voz alta tudo o que ele encontra na tela, assim como as operações que o usuário realiza com as teclas alfanuméricas e os comandos digitados.</p>\n\n<h2>Como funciona a navegação?</h2>\n<p>A navegação por leitores de tela funciona essencialmente de três maneiras:</p>\n<ul>\n<li>Lendo toda a página (navegação com as setas)</li>\n<li>Lendo os links (navegação com a tecla TAB\n<li>Lendo os cabeçalhos (navegação com a tecla H)\n</ul>\n\n<p>A partir desses três comandos principais, o usuário consegue se guiar pela estrutura da página enquanto vai acompanhando a fala humana emitida pelo software ao ler seu conteúdo.</p>\n\n<p>Por isso mesmo é importante que tanto o design quanto o código estejam prontos para receber o usuário que navega utilizando leitores de tela. Um simples cabeçalho quebrado ou mal implementado pode fazer com que o usuário se perca na página e tenha dificuldades em entender como a informação está organizada hierarquicamente.</p>\n\n<h2>Quais são os softwares mais comuns?</h2>\n<ul>\n<li>JAWS</li>\n<li>VIRTUAL VISION</li>\n<li>NVDA</li>\n<li>Orca</li>\n<li>Voice over</li>\n</ul>\n\n<p>Fonte: <a href=”https://www.acessibilidade.ufscar.br/recursos/leitores-de-tela/leitores-de-tela”>UFSCAR</a></p>"
 },
 {
   "id": 5,
   "content": "<h1>Daltonismo</h1>\n\n<p>O daltonismo, também chamado de discromatopsia ou até mesmo de deficiência visual das cores, refere-se à dificuldade de identificar e diferenciar certos intervalos de cores.<p>\n\n<h2>Tipos de daltonismo</h2>\n<p>Existem 4 tipos conhecidos de daltonismo:</p>\n\n<h3>Protanopia\n</h3><p>Quem possui este tipo de deficiência tende a perceber menos luz vermelha. Tons de vermelho, laranja e amarelo tendem a se tornar verde e pouco saturado.</p>\n\n<h3>Deuteranopia</h3>\n<p>A pessoa tem dificuldade de perceber a luz verde e isso prejudica na distinção da luz azul, amarelo, violeta, vermelho e verde.</p>\n\n<h3>Tritanopia</h3>\n<p>Pessoas com a tritanopia confundem o azul com verde e amarelo com violeta.</p>\n\n<h3>Monocromia</h3>\n<p>É a ausência da capacidade de diferenciar as cores, resultando na visão em escala de cinza. Este é do tipo raro.</p>\n\n\n<h2>Como desenvolver para daltônicos</h2>\n<h3>Contraste de cores</h3>\n<p>Utilize contraste de cores. Mesmo quem possui a monocromia tem dificuldade de perceber as diferentes variações de luz. Para garantir que haja leitura é importante definir cores que tenham contraste. Um exemplo: um texto em branco em cima de uma cor escura de fundo terá mais contraste que um texto branco em cima de um fundo amarelo. Recentemente eu criei um post falando sobre contraste e como melhorar a acessibilidade.</p>\n\n<h3>Utilize diferentes tipos de sombra em vez de diferentes tipos de cores</h3>\n<p>Este método de construir o design por meio de um esquema monocromático ajuda a diminuir efetivamente a frustração entre cores e ajuda a criar bons contrastes.</p>\n\n<h3>Enquanto estiver criando, experimente o daltonismo</h3>\n<p>Sim. É extremamente importante se colocar no lugar de usuários quando estiver criando qualquer coisa. Existem ferramentas que simulam o olhar de um daltônico. Plugins para o Sketch e o modo de visualização no Photoshop permitem essa simulação.</p>\n"
 },
 {
   "id": 6,
   "content": "\n<h1>O que é acessibilidade na web ?</h1>\n\n<p>As barreiras também existem na web e afetam milhões de pessoas com deficiência no mundo. Atualmente, estes cidadãos com dificuldades motoras, sensoriais ou cognitivas dependem muito dos progressos em termos de acessibilidade web para não beirarem à margem do desenvolvimento educativo, econômico e social.</p>\n\n<p>Passamos em média 6 horas e 43 minutos navegando na internet todos os dias, conforme revelam dados do relatório Digital 2020 publicado pela We Are Social e Hootsuite. Apesar desses dados, a internet continua sendo um território inacessível para a grande maioria das pessoas com deficiência no mundo, conforme denuncia o consórcio internacional World Wide Web Consortium (W3C) por meio de sua Web Accessibility Initiative (WAI).</p>\n\n<p>A Acessibilidade da Web combina programação, design e tecnologia para criar uma internet sem barreiras que permite que todos os usuários compreendam, aprendam, navegam e interajam totalmente com a Web. Assim como a indústria e a arquitetura, por exemplo, objetos de design, veículos e espaços adaptados às necessidades de pessoas com mobilidade reduzida ou com deficiências cognitivas, visuais e auditivas, e a internet também precisa seguir esse caminho.</p>"
 },
 {
   "id": 7,
   "content": "<h1>Princípios da acessibilidade: </h1>\n\n<h3>Princípio 1 : Perceptível</h3>\n<p>“A informação e os componentes da interface de utilizador têm de ser apresentados de forma a que os utilizadores as possam perceber.” - w3c\nTodo conteúdo não textual deve ter uma forma de exibição alternativa para que possa ser renderizado de outras maneiras de acordo com as necessidades do usuário, como caracteres ampliados, Braille, fala, símbolos ou linguagem mais simples.</p>\n\n<p>Fornecer alternativas para conteúdo em multimédia dinâmica ou temporal. Todo áudio deve ser acompanhado de uma legenda, áudio descrição e linguagem gestual se for um conteúdo pré-gravado</p>\n\n<p>Crie conteúdo que possa ser renderizado de forma diferente (como layouts de página mais simples) sem perder informações ou estrutura.</p>\n\n<p>Torne mais fácil para os usuários ouvir e ver o conteúdo, especialmente separando o primeiro plano do plano de fundo. A apresentação de texto deve ter um contraste mínimo de 4.5:1, exceto em: texto ampliado (no mínimo 3:1) ou logotipo. Também deve ter redimensionamento de texto em até 200% sem perder o conteúdo ou funcionalidade. Sons de fundo devem ter no mínimo 20 decibéis (exceto aqueles que têm menos de 2 segundos) e podem ser desligados.</p>\n\n<h3>Princípio 2 : Operável</h3>\n\n<p>Toda funcionalidade do conteúdo deve ser operável pelo teclado. Conteúdos com limite de tempo devem ser evitados, e,  caso existam, podem desligar ou prolongar o temporizador, exceto casos específicos (leilão, por exemplo). Informações em movimento que iniciam automaticamente, duram mais de 5 segundos e aparecem em paralelo com outro conteúdo podem ser pausadas, ocultadas ou paradas.</p>\n\n<p>Não criar conteúdo de uma forma que se sabe que pode causar convulsões (com mais de 3 flashes em um segundo). </p>\n\n<p>Qualquer interface de usuário operável por teclado tem um modo de operação no qual o indicador de foco do teclado é visível.</p>\n\n\n\n<h3>Princípio 3 : Compreensível</h3>\n\n<p>O idioma humano da página pode ser alterado</p>\n\n<p>Previsibilidade: Quando qualquer componente recebe foco, o contexto não é modificado. Componentes com a mesma funcionalidade sempre devem ser identificado da mesma maneira</p>\n\n<p>Erros detectados pelo ação do usuário, o item que apresenta erro é identificado e o erro é descrito com uma sugestão para eliminar o erro</p>\n\n<h3>Princípio 4 : Robusto</h3>\n\n<p>O conteúdo deve ser robusto o suficiente para ser interpretado de forma confiável por vários agentes de usuário, incluindo tecnologias assistivas. Devem  ser utilizadas as tags adequadas e IDs exclusivos</p>"
 }
]